stevenj/avr-libc3/include/avr/io/attiny88.h
/* Port Configuration Register-BBMD */
#define CPU_BBMD_CLEAR_gc (0x00) /* Port Configuration Register-BBMD - CLEAR */
#define CPU_BBMD_SET_gc   (0x80) /* Port Configuration Register-BBMD - SET */


/* Port Configuration Register-BBMC */
#define CPU_BBMC_CLEAR_gc (0x00) /* Port Configuration Register-BBMC - CLEAR */
#define CPU_BBMC_SET_gc   (0x40) /* Port Configuration Register-BBMC - SET */


/* Port Configuration Register-BBMB */
#define CPU_BBMB_CLEAR_gc (0x00) /* Port Configuration Register-BBMB - CLEAR */
#define CPU_BBMB_SET_gc   (0x20) /* Port Configuration Register-BBMB - SET */


/* Port Configuration Register-BBMA */
#define CPU_BBMA_CLEAR_gc (0x00) /* Port Configuration Register-BBMA - CLEAR */
#define CPU_BBMA_SET_gc   (0x10) /* Port Configuration Register-BBMA - SET */


/* Port Configuration Register-PUDD */
#define CPU_PUDD_CLEAR_gc (0x00) /* Port Configuration Register-PUDD - CLEAR */
#define CPU_PUDD_SET_gc   (0x08) /* Port Configuration Register-PUDD - SET */


/* Port Configuration Register-PUDC */
#define CPU_PUDC_CLEAR_gc (0x00) /* Port Configuration Register-PUDC - CLEAR */
#define CPU_PUDC_SET_gc   (0x04) /* Port Configuration Register-PUDC - SET */


/* Port Configuration Register-PUDB */
#define CPU_PUDB_CLEAR_gc (0x00) /* Port Configuration Register-PUDB - CLEAR */
#define CPU_PUDB_SET_gc   (0x02) /* Port Configuration Register-PUDB - SET */


/* Port Configuration Register-PUDA */
#define CPU_PUDA_CLEAR_gc (0x00) /* Port Configuration Register-PUDA - CLEAR */
#define CPU_PUDA_SET_gc   (0x01) /* Port Configuration Register-PUDA - SET */


/*
--------------------------------------------------------------------------------
EEPROM - EEPROM
--------------------------------------------------------------------------------
*/


/* EEPROM Programming Mode Bits */
#define EEPROM_EEPM_VAL_0x00_gc (0x00<<4) /* Erase and Write in one operation */
#define EEPROM_EEPM_VAL_0x01_gc (0x01<<4) /* Erase Only */
#define EEPROM_EEPM_VAL_0x02_gc (0x02<<4) /* Write Only */


/* EEPROM Ready Interrupt Enable */
#define EEPROM_EERIE_CLEAR_gc (0x00) /* EEPROM Ready Interrupt Enable - CLEAR */
#define EEPROM_EERIE_SET_gc   (0x08) /* EEPROM Ready Interrupt Enable - SET */


/* EEPROM Master Write Enable */
#define EEPROM_EEMPE_CLEAR_gc (0x00) /* EEPROM Master Write Enable - CLEAR */
#define EEPROM_EEMPE_SET_gc   (0x04) /* EEPROM Master Write Enable - SET */


/* EEPROM Write Enable */
#define EEPROM_EEPE_CLEAR_gc (0x00) /* EEPROM Write Enable - CLEAR */
#define EEPROM_EEPE_SET_gc   (0x02) /* EEPROM Write Enable - SET */


/* EEPROM Read Enable */
#define EEPROM_EERE_CLEAR_gc (0x00) /* EEPROM Read Enable - CLEAR */
#define EEPROM_EERE_SET_gc   (0x01) /* EEPROM Read Enable - SET */

#endif

/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* TC1 - Timer/Counter, 16-bit (0x0000) */
#define TC16_BASE       _SFR_MEM8 (0x0000) /* TC16 Base Address */
#define TC16_TIFR1      _SFR_MEM8 (0x0036) /* Timer/Counter Interrupt Flag register */
#define TC16_GTCCR      _SFR_MEM8 (0x0043) /* General Timer/Counter Control Register */
#define TC16_TIMSK1     _SFR_MEM8 (0x006F) /* Timer/Counter Interrupt Mask Register */
#define TC16_TCCR1A     _SFR_MEM8 (0x0080) /* Timer/Counter1 Control Register A */
#define TC16_TCCR1B     _SFR_MEM8 (0x0081) /* Timer/Counter1 Control Register B */
#define TC16_TCCR1C     _SFR_MEM8 (0x0082) /* Timer/Counter1 Control Register C */
#define TC16_TCNT1      _SFR_MEM16(0x0084) /* Timer/Counter1  Bytes */
#define TC16_TCNT1L     _SFR_MEM8 (0x0084) /* Timer/Counter1  Bytes LOW BYTE */
#define TC16_TCNT1H     _SFR_MEM8 (0x0085) /* Timer/Counter1  Bytes HIGH BYTE */
#define TC16_ICR1       _SFR_MEM16(0x0086) /* Timer/Counter1 Input Capture Register  Bytes */
#define TC16_ICR1L      _SFR_MEM8 (0x0086) /* Timer/Counter1 Input Capture Register  Bytes LOW BYTE */
#define TC16_ICR1H      _SFR_MEM8 (0x0087) /* Timer/Counter1 Input Capture Register  Bytes HIGH BYTE */
#define TC16_OCR1A      _SFR_MEM16(0x0088) /* Timer/Counter1 Output Compare Register  Bytes */
#define TC16_OCR1AL     _SFR_MEM8 (0x0088) /* Timer/Counter1 Output Compare Register  Bytes LOW BYTE */
#define TC16_OCR1AH     _SFR_MEM8 (0x0089) /* Timer/Counter1 Output Compare Register  Bytes HIGH BYTE */
#define TC16_OCR1B      _SFR_MEM16(0x008A) /* Timer/Counter1 Output Compare Register  Bytes */
#define TC16_OCR1BL     _SFR_MEM8 (0x008A) /* Timer/Counter1 Output Compare Register  Bytes LOW BYTE */
#define TC16_OCR1BH     _SFR_MEM8 (0x008B) /* Timer/Counter1 Output Compare Register  Bytes HIGH BYTE */

/* AC - Analog Comparator (0x0000) */
#define AC_BASE         _SFR_MEM8 (0x0000) /* AC Base Address */
#define AC_ACSR         _SFR_MEM8 (0x0050) /* Analog Comparator Control And Status Register */
#define AC_DIDR1        _SFR_MEM8 (0x007F) /* Digital Input Disable Register 1 */

/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE     _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB     _SFR_MEM8 (0x0023) /* Port B Input Pins */
#define PORTBB_DDRB     _SFR_MEM8 (0x0024) /* Port B Data Direction Register */
#define PORTBB_PORTB    _SFR_MEM8 (0x0025) /* Port B Data Register */

/* PORTD - I/O Port (0x0000) */
#define PORTDD_BASE     _SFR_MEM8 (0x0000) /* PORTDD Base Address */
#define PORTDD_PIND     _SFR_MEM8 (0x0029) /* Port D Input Pins */
#define PORTDD_DDRD     _SFR_MEM8 (0x002A) /* Port D Data Direction Register */
#define PORTDD_PORTD    _SFR_MEM8 (0x002B) /* Port D Data Register */

/* PORTC - I/O Port (0x0000) */
#define PORTCC_BASE     _SFR_MEM8 (0x0000) /* PORTCC Base Address */
#define PORTCC_PINC     _SFR_MEM8 (0x0026) /* Port C Input Pins */
#define PORTCC_DDRC     _SFR_MEM8 (0x0027) /* Port C Data Direction Register */
#define PORTCC_PORTC    _SFR_MEM8 (0x0028) /* Port C Data Register */

